Revit 2027 API
PointLoad.MomentVector Property
 The moment vector applied to the point load, oriented according to OrientTo setting.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ MomentVector { get; set; }
Public Property MomentVector As XYZ
	Get
	Set
public:
property XYZ^ MomentVector {
	XYZ^ get ();
	void set (XYZ^ value);
}
member MomentVector : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The default force unit is kN-m for metric, and kip-ft for imperial. Use UnitUtils class methods to convert value from or to internal units.
See Also
Reference
PointLoad Class
Autodesk.Revit.DB.Structure Namespace